app/helpers/application_helper.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def current_user
    user = User.find_by(id: session[:user_id])