app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["content", "hello world"], ["created_at", "2019-03-11 05:54:22.875748"], ["updated_at", "2019-03-11 05:54:22.875748"]]
---
  def create
    tweet = Tweet.new
    tweet.user_id = params[:user_id]
    tweet.content = params[:content]
    tweet.save