app/controllers/users_controller.rb

INSERT INTO "users" ("firstname", "lastname", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    user = User.new
    user.firstname = params[:firstname]
    user.lastname = params[:lastname]
    user.email = params[:email]
    user.password = params[:password]
    user.save!

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "dt@ga.co"], ["LIMIT", 1]]
---
  def sign_in
    user = User.find_by(email: params[:email])